#ifndef     RA3_TUMBLERS_DEFINE_H
#define     RA3_TUMBLERS_DEFINE_H

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    /// Общее количество элементов управления
    TUMBLERS_NUM = 25,

    /// Нажата кнопка "БОРТСЕТЬ ВКЛ."
    IS_BUTTON_PWR_ON = 0,
    /// Не нажата кнопка "БОРТСЕТЬ ОТКЛ."
    NO_BUTTON_PWR_OFF = 1,

    /// Нажата кнопка "СТАРТ" (запуск дизелей)
    IS_BUTTON_START = 2,
    /// Нажата кнопка "СТОП" (остановка дизелей)
    IS_BUTTON_STOP = 3,

    /// Выключатель СПТ
    IS_SWITCH_PARKING_BRAKE = 4,

    /// Нажата рукоятка бдительности (РБ)
    IS_BUTTON_RB = 5,

    /// Нажата рукоятка бдительности специальная (РБС)
    IS_BUTTON_RBS = 6,

    /// Нажата кнопка "Выбор скорости"
    IS_BUTTON_SPEED_SELECTION = 7,

    /// Нажата кнопка "Скорость +"
    IS_BUTTON_SPEED_PLUS = 8,

    /// Нажата кнопка "Скорость -"
    IS_BUTTON_SPEED_MINUS = 9,

    /// Нажата кнопка "Песок"
    IS_SAND = 10,

    /// Ключ ЭПК включён
    IS_KEY_EPK = 11,

    /// Нажато переключение реверса вперёд
    IS_SWITCH_REVERS_FWD = 12,

    /// Нажато переключение реверса назад
    IS_SWITCH_REVERS_BWD = 13,

    /// Нажата кнопка "Поддержание скорости"
    IS_BUTTON_SPEED_HOLD = 14,
    /// Зафиксировано нажатое положение кнопки "Поддержание скорости"
    IS_FIXED_SPEED_HOLD = 15,

    /// Нажата кнопка "Ступени"
    IS_BUTTON_STEP = 16,
    /// Зафиксировано нажатое положение кнопки "Ступени"
    IS_FIXED_STEP = 17,

    /// Нажата кнопка "Открыть двери левые"
    IS_BUTTON_DOOR_L_OPEN = 18,

    /// Нажата кнопка "Закрыть двери левые"
    IS_BUTTON_DOOR_L_CLOSE = 19,
    /// Зафиксировано нажатое положение кнопки "Закрыть двери левые"
    IS_FIXED_DOOR_L_CLOSE = 20,

    /// Нажата кнопка "Открыть двери правые"
    IS_BUTTON_DOOR_R_OPEN = 21,

    /// Нажата кнопка "Закрыть двери правые"
    IS_BUTTON_DOOR_R_CLOSE = 22,
    /// Зафиксировано нажатое положение кнопки "Закрыть двери правые"
    IS_FIXED_DOOR_R_CLOSE = 23,
};

#endif // RA3_TUMBLERS_DEFINE_H
