#ifndef     RA3_TUMBLERS_DEFINE_H
#define     RA3_TUMBLERS_DEFINE_H

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    /// Общее количество элементов управления
    TUMBLERS_NUM = 100,

    /// Кнопка "БОРТСЕТЬ ВКЛ."
    BUTTON_PWR_ON = 0,
    /// Кнопка ЭБОРТСЕТЬ ОТКЛ."
    BUTTON_PWR_OFF = 1,

    /// Кнопка "СТАРТ" (запуск дизелей)
    BUTTON_START = 2,
    /// Кнопка "СТОП" (остановка дизелей)
    BUTTON_STOP = 3
};

#endif // RA3_TUMBLERS_DEFINE_H
