#ifndef     RA3_TUMBLERS_DEFINE_H
#define     RA3_TUMBLERS_DEFINE_H

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    /// Общее количество элементов управления
    TUMBLERS_NUM = 8,

    /// Нажата кнопка "Песок"
    IS_SAND = 0,

    /// Нажата кнопка "Выбор скорости"
    IS_BUTTON_SPEED_SELECTION = 1,

    /// Нажата кнопка "Скорость +"
    IS_BUTTON_SPEED_PLUS = 2,

    /// Нажата кнопка "Скорость -"
    IS_BUTTON_SPEED_MINUS = 3,

    /// Зафиксировано нажатое положение кнопки "Поддержание скорости"
    IS_FIXED_SPEED_HOLD = 4,

    /// Зафиксировано нажатое положение кнопки "Закрыть двери левые"
    IS_FIXED_DOOR_L_CLOSE = 5,

    /// Зафиксировано нажатое положение кнопки "Закрыть двери правые"
    IS_FIXED_DOOR_R_CLOSE = 6,

    /// Зафиксировано нажатое положение кнопки "Ступени"
    IS_FIXED_STEP = 7
};

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    /// Общее количество элементов управления с задержкой срабатывания
    KEY_TUMBLERS_NUM = 16,

    /// Нажата кнопка "БОРТСЕТЬ ВКЛ."
    IS_BUTTON_PWR_ON = 0,
    /// Не нажата кнопка "БОРТСЕТЬ ОТКЛ."
    NO_BUTTON_PWR_OFF = 1,

    /// Нажата кнопка "СТАРТ" (запуск дизелей)
    IS_BUTTON_START = 2,
    /// Нажата кнопка "СТОП" (остановка дизелей)
    IS_BUTTON_STOP = 3,

    /// Ключ ЭПК включён
    IS_KEY_EPK = 4,

    /// Нажата рукоятка бдительности (РБ)
    IS_BUTTON_RB = 5,

    /// Нажата рукоятка бдительности специальная (РБС)
    IS_BUTTON_RBS = 6,

    /// Нажата кнопка "Поддержание скорости"
    IS_BUTTON_SPEED_HOLD = 7,

    /// Нажата кнопка "Открыть двери левые"
    IS_BUTTON_DOOR_L_OPEN = 8,

    /// Нажата кнопка "Закрыть двери левые"
    IS_BUTTON_DOOR_L_CLOSE = 9,

    /// Нажата кнопка "Открыть двери правые"
    IS_BUTTON_DOOR_R_OPEN = 10,

    /// Нажата кнопка "Закрыть двери правые"
    IS_BUTTON_DOOR_R_CLOSE = 11,

    /// Нажата кнопка "Ступени"
    IS_BUTTON_STEP = 12,

    /// Нажато переключение реверса вперёд
    IS_SWITCH_REVERS_FWD = 13,

    /// Нажато переключение реверса назад
    IS_SWITCH_REVERS_BWD = 14,

    /// Выключатель СПТ
    IS_SWITCH_PARKING_BRAKE = 15
};

#endif // RA3_TUMBLERS_DEFINE_H
