#ifndef     RA3_TUMBLERS_DEFINE_H
#define     RA3_TUMBLERS_DEFINE_H

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
enum
{
    /// Общее количество элементов управления
    TUMBLERS_NUM = 15,

    /// Нажата кнопка "БОРТСЕТЬ ВКЛ."
    IS_BUTTON_PWR_ON = 0,
    /// Не нажата кнопка "БОРТСЕТЬ ОТКЛ."
    NO_BUTTON_PWR_OFF = 1,

    /// Нажата кнопка "СТАРТ" (запуск дизелей)
    IS_BUTTON_START = 2,
    /// Нажата кнопка "СТОП" (остановка дизелей)
    IS_BUTTON_STOP = 3,

    /// Выключатель СПТ
    IS_SWITCH_PARKING_BRAKE = 4,

    /// Нажата рукоятка бдительности (РБ)
    IS_BUTTON_RB = 5,

    /// Нажата рукоятка бдительности специальная (РБС)
    IS_BUTTON_RBS = 6,

    /// Нажата кнопка "Выбор скорости"
    IS_BUTTON_SPEED_SELECTION = 7,

    /// Нажата кнопка "Скорость +"
    IS_BUTTON_SPEED_PLUS = 8,

    /// Нажата кнопка "Скорость -"
    IS_BUTTON_SPEED_MINUS = 9,

    /// Нажата кнопка "Поддержание скорости"
    IS_BUTTON_SPEED_HOLD = 10,

    /// Ключ ЭПК включён
    IS_KEY_EPK = 11,

    /// Нажато переключение реверса вперёд
    IS_SWITCH_REVERS_FWD = 12,

    /// Нажато переключение реверса назад
    IS_SWITCH_REVERS_BWD = 13
};

#endif // RA3_TUMBLERS_DEFINE_H
